InformationRegisters/НастройкиИнтеграцииBnovo.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиИнтеграцииBnovo</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидОплатыКартой</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОплатОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоследнейЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗагружатьОплатыНаличные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗагружатьОплатыКарта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчетнаяЗапись</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазделятьДоговораПоНомерамБроней</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторГостиницы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Гостиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Гостиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиИнтеграцииBnovo/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Запись.Организация) Тогда
		Запись.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	КонецЕсли;
	
	СоздаватьОтдельныйДоговор = ?(Запись.РазделятьДоговораПоНомерамБроней, 1, 0);
	APIKey = "             ";
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ПараметрыМетода = Новый Структура;
	ПараметрыМетода.Вставить("УчетнаяЗапись",      Запись.УчетнаяЗапись);
	ПараметрыМетода.Вставить("APIKey",             ?(ЗначениеЗаполнено(APIKey), APIKey, ""));
	ПараметрыМетода.Вставить("ДатаНачалаЗагрузки", Запись.ДатаПоследнейЗагрузки);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "ИнтеграцияBnovo.СоздатьОбновитьПодключение", ПараметрыМетода);
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		РезультатВыполнения = ПолучитьИзВременногоХранилища(ДлительнаяОперация.АдресРезультата);
		Если НЕ РезультатВыполнения.Результат Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон(НСтр("ru = 'При обновлении данных в Bnovo произошла ошибка: %1'"), РезультатВыполнения.СообщениеОбОшибке));
		КонецЕсли;
	ИначеЕсли ДлительнаяОперация.Статус = "Выполняется" Тогда
		ПараметрыЗаписи.Вставить("ДлительнаяОперация", ДлительнаяОперация);
	Иначе
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'При обновлении данных в Bnovo произошла ошибка'"));
	КонецЕсли;
	
	ПараметрыЗаписи.Вставить("ОбновитьИнтерфейс", ПроверитьУстановитьФункциональныеОпции());
КонецПроцедуры 

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Запись.РазделятьДоговораПоНомерамБроней = СоздаватьОтдельныйДоговор = 1;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если ПараметрыЗаписи.Свойство("ОбновитьИнтерфейс") 
		И ПараметрыЗаписи.ОбновитьИнтерфейс Тогда
	
		ОбновитьИнтерфейс();
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("ДлительнаяОперация") Тогда
		ДлительныеОперацииКлиент.ОжидатьЗавершение(
			ПараметрыЗаписи.ДлительнаяОперация, 
			Новый ОписаниеОповещения("ПослеОбновленияПодключения", ЭтотОбъект));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеОбновленияПодключения(ДлительнаяОперация, ДополнительныеПараметры) Экспорт
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		РезультатВыполнения = ПолучитьИзВременногоХранилища(ДлительнаяОперация.АдресРезультата);
		Если РезультатВыполнения.Результат Тогда
			Возврат;
		КонецЕсли;
		
		ТекстОшибки = СтрШаблон(НСтр("ru = 'При обновлении данных в Bnovo произошла ошибка: %1'"), РезультатВыполнения.СообщениеОбОшибке);
	Иначе
		ТекстОшибки = НСтр("ru = 'При обновлении данных в Bnovo произошла ошибка'");
	КонецЕсли;
	
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
КонецПроцедуры


&НаСервере
Функция ПроверитьУстановитьФункциональныеОпции()
	
	ОбновитьИнтерфейс = Ложь;
	
	Если ЗначениеЗаполнено(Запись.ВидОплатыКартой) Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		Если Не Константы.ИспользоватьОплатуПоПлатежнымКартам.Получить() Тогда
			Константы.ИспользоватьОплатуПоПлатежнымКартам.Установить(Истина);
			ОбновитьИнтерфейс = Истина;
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Запись.Покупатель) Тогда
		
		УстановитьПривилегированныйРежим(Истина);
		Если Не Константы.ИспользоватьПредоплатыВРознице.Получить() Тогда
			Константы.ИспользоватьПредоплатыВРознице.Установить(Истина);
			ОбновитьИнтерфейс = Истина;
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
	
	Возврат ОбновитьИнтерфейс;
	
КонецФункции

#КонецОбласти
